src/cf/InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПрименяющийУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПлательщикСтраховыхВзносовПФР_ФФОМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИПТарифыФиксированныхВзносов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыОбъектовНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Доходы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыМинусРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ИПТарифыФиксированныхВзносов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ИПТарифыФиксированныхВзносов</Name>
			<Comment>Тарифы фиксированных взносов ИП согласно ст. 430 НК РФ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Единый</Name>
					<Comment>Единый тариф согласно п.1.2 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВоенныйПенсионер</Name>
					<Comment>Тариф для военных пенсионеров согласно п.1.4. ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникСЭЗнаНТ</Name>
					<Comment>Тариф для участника СЭЗ в соответствии с п.1.3 ст. 430 НК РФ</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/УчетСтраховыхВзносовУНФПовтИсп/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает признак упрощенного зачета взносов, подлежащих уплате
// Федеральный закон от 31.07.2023 N 389-ФЗ
//
// Параметры:
//   Организация               - СправочникСсылка.Организации - ИП, который уплачивает фиксированные взносы
//   ПериодСобытия             - Дата - Период, за который оплачиваются фиксированные взносы
//   УчитыватьПереходныйПериод - Булево - Признак, при котором проверяется дата перехода на упрощенный зачет взносов
//
// Возвращаемое значение:
//   Булево
//
Функция УпрощенныйЗачетФиксированныхВзносов(Организация, ПериодСобытия, УчитыватьПереходныйПериод = Истина) Экспорт
	
	Если РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация)
		Или УчитыватьПереходныйПериод И '20230901' > ПериодСобытия Тогда 	
		Возврат Ложь;
	КонецЕсли;
	
	ПериодДействияЗакона = '20230101';  
	
	СистемаНалогообложенияОрганизации = РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(Организация, ПериодСобытия);
	
	ПрименяетсяУСНДоходы = СистемаНалогообложенияОрганизации.ОбъектНалогообложения = Перечисления.ВидыОбъектовНалогообложения.Доходы;
	ПрименяетсяУСНДоходыМинусРасходы = СистемаНалогообложенияОрганизации.ОбъектНалогообложения = Перечисления.ВидыОбъектовНалогообложения.ДоходыМинусРасходы;
	ПлательщикНДФЛ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИПИспользуетТрудНаемныхРаботников");
	
	Если Не ПлательщикНДФЛ И Не ПрименяетсяУСНДоходыМинусРасходы Тогда
		ПрименяетсяПСН = СистемаНалогообложенияОрганизации.ПрименяетсяПатент;
	Иначе
		// При совмещение с ОСН или УСН доходы минус расходы считаем, что порядок зачета через пополнение ЕНС и резервирование сумм
		ПрименяетсяПСН = Ложь;
	КонецЕсли;
	
	Возврат ПериодСобытия >= ПериодДействияЗакона И (ПрименяетсяУСНДоходы Или ПрименяетсяПСН);
	
КонецФункции 

// Возвращает признак уплаты взноса с доходов свыше предела
// Взнос платится в периоды, когда не действует пониженный тариф фиксированных взносов (ст. 430 НК РФ)
//
// Параметры:
//   Организация   - СправочникСсылка.Организации - ИП, для которого необходимо рассчитать признак уплаты взносов с доходов
//   НачалоПериода - Дата - Дата начала периода
//   КонецПериода  - Дата - Дата окончания периода
//
// Возвращаемое значение:
//   Булево
//
Функция УплачиваетсяВзносСДоходов(Организация, НачалоПериода, КонецПериода) Экспорт
	
	Если Не ЗначениеЗаполнено(Организация)
		Или РегламентированнаяОтчетностьПереопределяемый.ЭтоЮридическоеЛицо(Организация) Тогда
		// Если в периоде платился только НПД, тогда не нужно платить взносы с доходов
		Возврат Ложь;
	КонецЕсли;
	
	// Если учет еще не ведется или передан год до первого года ведения учета,
	// доходы за предыдущие годы заведомо нулевые - взноса не может быть
	ДатаНачалаУчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ДатаРегистрации");
	Если ДатаНачалаУчета = Неопределено Или Год(ДатаНачалаУчета) > Год(НачалоПериода) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если в периоде нужно было платить взносы не по пониженному тарифу, то тогда необходимо рассчитать взнос с доходов за этот период
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ИСТИНА КАК ПоЕдиномуТарифу
	|ИЗ
	|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС КАК НастройкиУчетаСтраховыхВзносовИП
	|ГДЕ
	|	НастройкиУчетаСтраховыхВзносовИП.Период МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НастройкиУчетаСтраховыхВзносовИП.Организация = &Организация
	|	И НастройкиУчетаСтраховыхВзносовИП.ПлательщикСтраховыхВзносовПФР_ФФОМС
	|	И НЕ НастройкиУчетаСтраховыхВзносовИП.Тариф В (&Тарифы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ИСТИНА
	|ИЗ
	|	РегистрСведений.НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМС.СрезПоследних(&НачалоПериода, Организация = &Организация) КАК НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних
	|ГДЕ
	|	НЕ НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.Тариф В (&Тарифы)
	|	И НастройкиУчетаСтраховыхВзносовИП_ПФР_ФФОМССрезПоследних.ПлательщикСтраховыхВзносовПФР_ФФОМС");
	
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Тарифы", ПониженныеТарифыСтраховыхВзносов());
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПониженныеТарифыСтраховыхВзносов() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить(Перечисления.ИПТарифыФиксированныхВзносов.ВоенныйПенсионер); // п.1.4 ст.430 НК РФ
	Результат.Добавить(Перечисления.ИПТарифыФиксированныхВзносов.УчастникСЭЗнаНТ); // п.1.3 ст.430 НК РФ
	
	Возврат Результат
	
КонецФункции

#КонецОбласти
